In [17]:
import pandas as pd
import datetime as dt
pivot_data=[{'Name':'john','date':14-6-2021,'sales':11},
                {'Name':'dan','date':15-7-2021,'sales':38},
                {'Name':'joe','date':16-8-2021,'sales':45},
                {'Name':'joe','date':11-9-2021,'sales':55},
                {'Name':'dan','date':16-7-2021,'sales':45},
                {'Name':'ram','date':10-12-2021,'sale':21},
                {'Name':'joe','date':9-1-2021,'sales':13},
                {'Name':'raj','date':1-5-2021,'sales':67},
                {'Name':'tara','date':16-8-2021,'sales':45}]
df=pd.DataFrame(pivot_data)
df

   Name  date  sales  sale
0  john -2013   11.0   NaN
1   dan -2013   38.0   NaN
2   joe -2013   45.0   NaN
3   joe -2019   55.0   NaN
4   dan -2012   45.0   NaN
5   ram -2023    NaN  21.0
6   joe -2013   13.0   NaN
7   raj -2025   67.0   NaN
8  tara -2013   45.0   NaN

In [10]:
import pandas as pd
import numpy as np

ser1 = pd.Series([1,2,3,4,5])
ser2 = pd.Series([4,5,6,7,8])

union =pd.Series(np.union1d(ser1,ser2))

print(union)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [12]:
intersect =pd.Series(np.intersect1d(ser1,ser2))

print(intersect)

0    4
1    5
dtype: int64

In [13]:
notcommonseries =union[~union.isin(intersect)]

print(notcommonseries)

0    1
1    2
2    3
5    6
6    7
7    8
dtype: int64

In [21]:
import pandas as pd
import numpy as np
ser1=pd.Series(['a','g','u',])
ser2=pd.Series(['a','g','o','j'])
ser3=pd.Series(['j','g',''])
union =pd.Series(np.union1d(ser1,ser2))
union

0    a
1    g
2    j
3    o
4    u
dtype: object

In [22]:
tuple()
print("tuple11")

tuple11